const String consentText = """
บริษัทได้รับข้อมูลส่วนบุคคลของผู้ลงทะเบียน และได้เก็บรวบรวมและประมวลผลตามหนังสือให้ความยินยอมการเก็บรวบรวม ประมวลผล ใช้ 
และเปิดเผยข้อมูลส่วนบุคคลฉบับนี้โดยบริษัทได้จัดเก็บรวบรวมและประมวลผลข้อมูลส่วนบุคคลเท่าที่จําเป็นตามวัตถุประสงค์ในการเก็บรวบรวม ประมวลผล ใช้ และเปิดเผยข้อมูลส่วนบุคคลของบริษัท ทั้งนี้ ได้จําแนกประเภทของข้อมูลส่วนบุคคล ดังนี้

การเก็บรวบรวมข้อมูล
1. ได้รับข้อมูลส่วนบุคคลโดยตรง
 บริษัทได้รับข้อมูลส่วนบุคคลของผู้สมัครงานโดยตรง โดยเก็บรวบรวมข้อมูลส่วนบุคคล จากกระบวนการสรรหาและรับ
สมัครงาน หรือหนังสือให้ความยินยอม ทั้งนี้ ในบางกรณีบริษัทอาจจะได้รับข้อมูลจากบุคคลที่สามในกรณีอื่นด้วย
 2. ได้รับข้อมูลส่วนบุคคลของบุคคลอื่นโดยตรง
 ข้อมูลส่วนบุคคลของบุคคลอื่นที่ผู้สมัครงานได้ให้ไว้กับบริษัท ซึ่งอาจจะให้ข้อมูลส่วนบุคคลที่เกี่ยวกับบุคคลอื่น ได้แก่
บุคคลติดต่อกรณีฉุกเฉิน ซึ่งบริษัทใช้ข้อมูลเหล่านั้นเพื่อการติดต่อในกรณีที่เกี่ยวกับการสมัครงานเท่านั้น
 3. บริษัทอาจรวบรวมข้อมูลส่วนบุคคลจากองค์กรอื่น
 บริษัทอาจรวบรวมข้อมูลจากองค์กรอื่นเพื่อกระบวนการสรรหาและคัดเลือกพนักงาน ได้แก่ กรณีที่ผู้สมัครงานมีการ
สมัครงานผ่านตัวแทนรับจ้างจัดหางาน หรือเว็บไซต์หางาน เป็นต้น
4. บริษัทอาจจัดเก็บบันทึกข้อมูลการเข้าออกเว็บไซต์ (Log Files) ของท่าน โดยจะจัดเก็บข้อมูลดังนี้ หมายเลขไอพี (IP
Address) หรือ เวลาการเข้าใช้งาน เป็นต้น

""";
